package com.test;

public class TestTime {

	public static void main(String[] args) {
		
		int a = 1;

		long beforeTime = System.currentTimeMillis(); // ms단위
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		System.out.println("a : "+a);
		long afterTime = System.currentTimeMillis(); // ms단위
		long time = ( afterTime - beforeTime ); // ms단위
		System.out.println("time : "+time);
		System.out.println("10억번 계산 소요시간 (s) : "+(time/1000)); // s단위
		// 10억번의 계산에선 1초도 소요되지 않았다.
		
		beforeTime = System.currentTimeMillis(); // ms단위
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 100억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 200억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 300억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 400억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 500억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 100억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 200억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 300억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 400억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 1000억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 100억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 200억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 300억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 400억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 500억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 100억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 200억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 300억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 400억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 10억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 20억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 30억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 40억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 50억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 60억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 70억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 80억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 90억번
			a += 1;
		}
		for (int i = 0; i < 1000000000; i++) { // 1000억번
			a += 1;
		}
		System.out.println("a : "+a);
		afterTime = System.currentTimeMillis(); // ms단위
		time = ( afterTime - beforeTime ); // ms단위
		System.out.println("time : "+time);
		System.out.println("30억번 계산 소요시간 (s) : "+(time/1000)); // s단위
		//a의 값을 오버플로우 돼서 맞지않겠지만 횟수만 보도록 하자.
		
	}

}
